## Ejercicio sobre conceptos básicos de SQL

**Desarrollado por:** Orlando Patricio Chacón Molina

**Fecha de creación:** 2022-03-28

**Fecha de actualización:** 2022-03-28

SQLAlchemy es un envoltorio para Python que nos permite escribir consultas SQL en Python. Lo usaremos para practicar los conceptos básicos de SQL en Python.

Primero, necesitamos conectarnos a una base de datos. En este paso, solo leeremos una tabla en SQL. Crearemos una base de datos SQLite y cargaremos nuestros datos, que puedes descargar desde aquí.

Los datos (de esta fuente) describe detalles sobre diferentes colegios.

### Crea la Base de datos SQLite

Para crear una base de datos SQLite utilizando SQLAlchemy,, necesitamos cargar los datos en Google Drive y leerlos como un marco de datos de Pandas. El código a continuación carga los datos, crea una conexión con un motor de SQLite y carga los datos como una tabla SQLite. Para tu conveniencia, acá  hay un documento con código para que empieces. Has una copia del documento para editarla.

In [ ]:
# imports
import pandas as pd
from sqlalchemy import create_engine

# cargar datos: ¡cambia la ruta para que coincida con tu unidad!
school = pd.read_csv('data/School Details.csv')
# Asegúrate de que estén cargados correctamente
school.head(2)
# crear motor sqlite
engine = create_engine('sqlite:///school.db', echo=True)
# crear conexión con el motor
conn = engine.connect()

# agregar marco de datos como una tabla en sqlite
sqlite_table = "school_details"
school.to_sql(sqlite_table, conn, if_exists='fail')

In [2]:
# Escribe tu consulta SQL en esta cadena
sql = """SELECT * 
FROM school_details
"""
# Lee la consulta sql en pandas para ver los resultados
df = pd.read_sql_query(sql, engine)
df.columns.values

2022-03-28 18:18:29,085 INFO sqlalchemy.engine.Engine SELECT *
FROM school_details

2022-03-28 18:18:29,086 INFO sqlalchemy.engine.Engine [raw sql] ()

array(['index', 'DistrictName', 'EstablishmentCode', 'EstablishmentName',
       'BRCName', 'CRCName', 'SchoolLevel', 'ManagementName',
       'LocalityHabitation', 'SubdivisionName', 'ConstituencyName',
       'RevenueBlockName', 'CivicBodyName', 'WardName', 'PostOfficeName',
       'PhoneNo', 'FaxNo', 'EmailID', 'Website', 'LocatedInRuralOrUrban',
       'DiseCode', 'EstablishedDate', 'DistrictHQDistance (in Km)',
       'CRCDistance (in Km)', 'BACDistance (in Km)', 'IsRecognized',
       'RecognizedBy', 'ContactPersonName', 'LowestClass', 'HighestClass',
       'BoardName'], dtype=object)

## Llama las columnas NombreEstablecimiento, NivelEscolar y SitioWeb.

In [3]:
# Escribe tu consulta SQL en esta cadena
sql = """SELECT EstablishmentName, SchoolLevel, Website
FROM school_details
"""
# Lee la consulta sql en pandas para ver los resultados
df = pd.read_sql_query(sql, engine)
df.head()

2022-03-28 18:18:31,334 INFO sqlalchemy.engine.Engine SELECT EstablishmentName, SchoolLevel, Website
FROM school_details

2022-03-28 18:18:31,335 INFO sqlalchemy.engine.Engine [raw sql] ()

,EstablishmentName,SchoolLevel,Website
0,BUDANG GOVERNMENT PRIMARY SCHOOL (E),PS,None
1,CENTRAL PENDAM GOVERNMENT SENIOR SECONDARY SCHOOL,SSS,None
2,"CENTRAL POINT ACADEMY, CENTRAL PENDAM",SS,www.facebook.com/khanalkeshav (Group-CPA)
3,CHEURIBOTEY GOVERNMENT JUNIOR HIGH SCHOOL (E),JHS,None
4,DUGA GOVERNMENT SECONDARY SCHOOL,SS,None

## Muestra el NombreEstablecimiento y DistanciaDistrito (en km) de colegios en los que DistanciaDistrito (en km) es más de 100 km.0

In [4]:
# Escribe tu consulta SQL en esta cadena
sql = """SELECT EstablishmentName, [DistrictHQDistance (in Km)]
FROM school_details
WHERE [DistrictHQDistance (in Km)] > 100
"""
# Lee la consulta sql en pandas para ver los resultados
df = pd.read_sql_query(sql, engine)
df.head()

2022-03-28 18:18:32,497 INFO sqlalchemy.engine.Engine SELECT EstablishmentName, [DistrictHQDistance (in Km)]
FROM school_details
WHERE [DistrictHQDistance (in Km)] > 100

2022-03-28 18:18:32,497 INFO sqlalchemy.engine.Engine [raw sql] ()

                    EstablishmentName  DistrictHQDistance (in Km)
0  DODACHEN GOVERNMENT PRIMARY SCHOOL                       150.0
1   DEOLING GOVERNMENT PRIMARY SCHOOL                       107.0
2       PEMA TSEL ACADEMY(PHADAMCHEN)                       110.0
3    ZULUCK GOVERNMENT PRIMARY SCHOOL                       120.0
4   BHARENG GOVERNMENT PRIMARY SCHOOL                       150.0

## Muestra NombreEstablecimiento, NivelEscolar, DistanciaDistrito (en km) de colegios donde el nivel escolar es Junior High School.

In [5]:
# Escribe tu consulta SQL en esta cadena
sql = """SELECT EstablishmentName, SchoolLevel, [DistrictHQDistance (in Km)]
FROM school_details
WHERE SchoolLevel == 'JHS'
"""
# Lee la consulta sql en pandas para ver los resultados
df = pd.read_sql_query(sql, engine)
df.head()

2022-03-28 18:18:33,319 INFO sqlalchemy.engine.Engine SELECT EstablishmentName, SchoolLevel, [DistrictHQDistance (in Km)]
FROM school_details
WHERE SchoolLevel == 'JHS'

2022-03-28 18:18:33,319 INFO sqlalchemy.engine.Engine [raw sql] ()

,EstablishmentName,SchoolLevel,DistrictHQDistance (in Km)
0,CHEURIBOTEY GOVERNMENT JUNIOR HIGH SCHOOL (E),JHS,60.0
1,"PADMA KUMARI PUBLIC SCHOOL, DUGA",JHS,48.0
2,SAJONG GOVERNMENT JUNIOR HIGH SCHOOL,JHS,57.0
3,SINGLEYBONG GOVERNMENT JUNIOR HIGH SCHOOL,JHS,38.0
4,"SUNRISE ACADEMY, DUGA",JHS,47.0

## Muestra NombreEstablecimiento, NivelEscolar, DistanciaDistrito (en km) de colegios que contengan las palabras “Junior High” en su nombre.

In [6]:
# Escribe tu consulta SQL en esta cadena
sql = """SELECT EstablishmentName, SchoolLevel, [DistrictHQDistance (in Km)]
FROM school_details
WHERE EstablishmentName like '%Junior High%'
"""
# Lee la consulta sql en pandas para ver los resultados
df = pd.read_sql_query(sql, engine)
df.head()

2022-03-28 18:18:33,756 INFO sqlalchemy.engine.Engine SELECT EstablishmentName, SchoolLevel, [DistrictHQDistance (in Km)]
FROM school_details
WHERE EstablishmentName like '%Junior High%'

2022-03-28 18:18:33,757 INFO sqlalchemy.engine.Engine [raw sql] ()

,EstablishmentName,SchoolLevel,DistrictHQDistance (in Km)
0,CHEURIBOTEY GOVERNMENT JUNIOR HIGH SCHOOL (E),JHS,60.0
1,SAJONG GOVERNMENT JUNIOR HIGH SCHOOL,JHS,57.0
2,SINGLEYBONG GOVERNMENT JUNIOR HIGH SCHOOL,JHS,38.0
3,BORDANG GOVERNMENT JUNIOR HIGH SCHOOL,JHS,33.0
4,RANGPO BAZAR GOVERNMENT JUNIOR HIGH SCHOOL,JHS,47.0

## Muestra NombreEstablecimiento, NivelEscolar, DistanciaDistrito (en km) de colegios cuyo nombre comience con la letra “C”. Ordena los resultados de forma alfabética por nombre de colegio  y limita los resultados de la consulta a 10 líneas.

In [7]:
# Escribe tu consulta SQL en esta cadena
sql = """SELECT EstablishmentName, SchoolLevel, [DistrictHQDistance (in Km)]
FROM school_details
WHERE EstablishmentName like 'C%'
ORDER BY EstablishmentName
LIMIT 10
"""
# Lee la consulta sql en pandas para ver los resultados
df = pd.read_sql_query(sql, engine)
df

2022-03-28 18:18:34,106 INFO sqlalchemy.engine.Engine SELECT EstablishmentName, SchoolLevel, [DistrictHQDistance (in Km)]
FROM school_details
WHERE EstablishmentName like 'C%'
ORDER BY EstablishmentName
LIMIT 10

2022-03-28 18:18:34,106 INFO sqlalchemy.engine.Engine [raw sql] ()

,EstablishmentName,SchoolLevel,DistrictHQDistance (in Km)
0,C.M.RAI GOVERNMENT SECONDARY SCHOOL (OMCHU),SS,26.0
1,"CANAAN SCHOOL, RANIPOOL",JHS,0.0
2,"CANARY BIRD ACADEMY, KARTOK",PS,38.0
3,"CAROL ACADEMY, YANGSUM UPPER BERFOK",JHS,50.0
4,CENTRAL MARTAM GOVERNMENT JUNIOR SCHOOL,JHS,50.0
5,CENTRAL PATUK GOVERNMENT PRIMARY SCHOOL,PS,48.0
6,CENTRAL PENDAM GOVERNMENT SENIOR SECONDARY SCHOOL,SSS,50.0
7,"CENTRAL POINT ACADEMY, CENTRAL PENDAM",SS,49.0
8,"CENTRAL SCHOOL FOR TIBETAN , RAVANGLA",JHS,26.0
9,CHAKUNG GOVERNMENT SENIOR SECONDARY SCHOOL,SSS,55.0

## Muestra los nombres de los colegios de áreas urbanas. Ordena los resultados en orden alfabético inverso.

In [8]:
# Escribe tu consulta SQL en esta cadena
sql = """SELECT EstablishmentName
FROM school_details
WHERE LocatedInRuralOrUrban = 'Urban Area'
ORDER BY EstablishmentName DESC
"""
# Lee la consulta sql en pandas para ver los resultados
df = pd.read_sql_query(sql, engine)
df.head()

2022-03-28 18:18:34,729 INFO sqlalchemy.engine.Engine SELECT EstablishmentName
FROM school_details
WHERE LocatedInRuralOrUrban = 'Urban Area'
ORDER BY EstablishmentName DESC

2022-03-28 18:18:34,729 INFO sqlalchemy.engine.Engine [raw sql] ()

                       EstablishmentName
0       ZULUCK GOVERNMENT PRIMARY SCHOOL
1       ZOOM GOVERNMENT SECONDARY SCHOOL
2  ZITLANG GOVERNMENT JUNIOR HIGH SCHOOL
3       ZINGLA GOVERNMENT PRIMARY SCHOOL
4                   ZENITH PUBLIC SCHOOL

## Repite la consulta anterior, pero renombra la columna que se muestra como “nombre”.

In [9]:
# Escribe tu consulta SQL en esta cadena
sql = """SELECT EstablishmentName as nombre
FROM school_details
WHERE LocatedInRuralOrUrban = 'Urban Area'
ORDER BY EstablishmentName DESC
"""
# Lee la consulta sql en pandas para ver los resultados
df = pd.read_sql_query(sql, engine)
df.head()

2022-03-28 18:18:35,594 INFO sqlalchemy.engine.Engine SELECT EstablishmentName as nombre
FROM school_details
WHERE LocatedInRuralOrUrban = 'Urban Area'
ORDER BY EstablishmentName DESC

2022-03-28 18:18:35,595 INFO sqlalchemy.engine.Engine [raw sql] ()

                                  nombre
0       ZULUCK GOVERNMENT PRIMARY SCHOOL
1       ZOOM GOVERNMENT SECONDARY SCHOOL
2  ZITLANG GOVERNMENT JUNIOR HIGH SCHOOL
3       ZINGLA GOVERNMENT PRIMARY SCHOOL
4                   ZENITH PUBLIC SCHOOL